КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиДополнительныхРеквизитов/КонтурЛогистика_НастройкиДополнительныхРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_НастройкиДополнительныхРеквизитов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отображать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФ/Module.bsl
Процедура ВывестиДополнительныеРеквизиты(Форма, Ссылка) Экспорт

	Попытка
		ВывестиДополнительныеРеквизитыНаФорму(Форма, Ссылка);
	Исключение
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстОшибки = "Ошибка при отображение дополнительных реквизитов логистики. Ошибка: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, Ссылка, ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#Область ВыводРеквизитовНаФорму

Процедура ВывестиДополнительныеРеквизитыНаФорму(Форма, Ссылка)
	
	вычОтображениеЗакладок = Вычислить("ОтображениеЗакладок");
	
	СписокДополнительныхРеквизитов = СписокДополнительныхРеквизитовОбъекта(Ссылка, Истина, Форма);
			
	Если Не ЗначениеЗаполнено(СписокДополнительныхРеквизитов) Тогда
		Сообщить("Список дополнительных реквизитов объекта не задан");
		Возврат;
	КонецЕсли;
	
	КолвоГрупп = 0;
	КолвоРеквизитов = 0;
	КолвоРеквизитовТЧ = 0;
	КоличествоРеквизитов(СписокДополнительныхРеквизитов, КолвоГрупп, КолвоРеквизитов, КолвоРеквизитовТЧ);
	
	Если КолвоРеквизитов = 0 И КолвоРеквизитовТЧ = 0 Тогда
		Возврат;	
	КонецЕсли;

	ОсновнаяПанель = Неопределено;
	
	ОбщийМодуль = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("КонтурЛогистика_ДопРеквизитыОФ_Манифест");
	Если ОбщийМодуль = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаименованияПанелей = ОбщийМодуль.НаименованияПанелей();
	
	Для каждого ИмяПанели Из НаименованияПанелей Цикл 
        Если Форма.ЭлементыФормы.Найти(ИмяПанели) <> Неопределено Тогда
			ОсновнаяПанель = Форма.ЭлементыФормы[ИмяПанели];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОсновнаяПанель = Неопределено И КолвоРеквизитов > 0 Тогда
		Сообщить("На форме отсутствует панель с именем из манифеста для добавления дополнительных реквизитов");
		Возврат;	
	КонецЕсли;
	
	Если КолвоРеквизитов > 0  Тогда
		ОсновнаяПанель.Страницы.Добавить("КонтурЛогитика_ДополнительныеРеквизиты_ОсновнаяПанельСтраница", "Дополнительные реквизиты (Контур.Логистика)");		 
		ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.Страницы.КонтурЛогитика_ДополнительныеРеквизиты_ОсновнаяПанельСтраница;
	КонецЕсли;
			
	ОбъектМетаданных = Ссылка.Метаданные();
	
	Лево = 5;
	Верх = 5;
	ПоследнийЭФ = Неопределено;
	
	Если КолвоГрупп > 1 Тогда		
		ПанельДополнительныеРеквизиты = ВывестиПанель(Форма, "КонтурЛогитика_ДополнительныеРеквизитыПанель", ОсновнаяПанель, Верх, Лево);	
		ПанельДополнительныеРеквизиты.ТекущаяСтраница.Имя = "КонтурЛогитика_ДополнительныеРеквизитыПанельОсновноеСтраница";
		ПанельДополнительныеРеквизиты.ТекущаяСтраница.Заголовок = "Основные";
		ПанельДополнительныеРеквизиты.ТекущаяСтраница.Видимость = Ложь;
		ПанельДополнительныеРеквизиты.ОтображениеЗакладок = вычОтображениеЗакладок.СлеваГоризонтально;
	Иначе
		ПанельДополнительныеРеквизиты = ОсновнаяПанель;
	КонецЕсли;
	
	ШиринаОбласти = 0;
	
	Для каждого РеквизитГруппа Из СписокДополнительныхРеквизитов Цикл
					
		Если РеквизитГруппа.Значение.Свойство("ЗаголовокГруппы") Тогда
			
			Если РеквизитГруппа.Значение.Реквизиты.Количество() > 0 Тогда
				
				Если КолвоГрупп > 1 Тогда
					
					ТекПанель = ПанельДополнительныеРеквизиты.Страницы.Найти(РеквизитГруппа.Ключ + "Страница");
					Если ТекПанель = Неопределено Тогда 
						ПанельДополнительныеРеквизиты.Страницы.Добавить(РеквизитГруппа.Ключ + "Страница", РеквизитГруппа.Значение.ЗаголовокГруппы);
						ПанельДополнительныеРеквизиты.ТекущаяСтраница = ПанельДополнительныеРеквизиты.Страницы[РеквизитГруппа.Ключ + "Страница"];					
					КонецЕсли;
					
				Иначе
					ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.Страницы.КонтурЛогитика_ДополнительныеРеквизиты_ОсновнаяПанельСтраница;	
				КонецЕсли;
				
				тзРазметка = РеквизитГруппа.Значение.тзРазметка;
				МаксШиринаЗаголока = МаксимальноеЗначениеВМассиве(тзРазметка.ВыгрузитьКолонку("Ширина"));
				
				Лево = 5;
				Верх = 5;
				ПоследнийЭФ = Неопределено;
				
				Для каждого Реквизит Из РеквизитГруппа.Значение.Реквизиты Цикл
										
					Если ОбъектМетаданных.Реквизиты.Найти(Реквизит.Ключ) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
										
					Высота = тзРазметка.Найти(Реквизит.Ключ, "Реквизит").Высота; 
					ВывестиРеквизит(Форма, Реквизит, ПоследнийЭФ, ПанельДополнительныеРеквизиты, Верх, Лево, МаксШиринаЗаголока, Высота);
					
				КонецЦикла;				
				
			КонецЕсли;
			
		ИначеЕсли РеквизитГруппа.Значение.Свойство("ЗаголовокТЧ") Тогда
				
			ТЧ = РеквизитГруппа.Ключ;
			
			Для каждого Реквизит Из РеквизитГруппа.Значение.Реквизиты Цикл
				
				Если ОбъектМетаданных.ТабличныеЧасти[ТЧ].Реквизиты.Найти(Реквизит.Ключ) = Неопределено Тогда				
					Продолжить;					
				КонецЕсли;
				
				ВывестиРеквизитТЧ(Форма, ОбъектМетаданных, ТЧ, Реквизит);
				
				ПервыйВГруппе = Ложь;
				
			КонецЦикла;			
			
		КонецЕсли;
				
	КонецЦикла;
	
	ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.Страницы[0];
	
	Если СписокДополнительныхРеквизитов.Количество() > 1 Тогда
		ПанельДополнительныеРеквизиты.ТекущаяСтраница = ПанельДополнительныеРеквизиты.Страницы[1];
	КонецЕсли;
		
КонецПроцедуры

Процедура ВывестиРеквизит(Форма, Реквизит, ПоследнийЭФ, ПанельСтраниц, Верх, Лево, Знач ШиринаЗаголовка = 0, Высота)
	
	Имя = Реквизит.Ключ;
	Заголовок = Реквизит.Значение.Заголовок;
	ЭтоФлажок = Реквизит.Значение.ЭтоФлажок;
	
	Если ШиринаЗаголовка = 0 Тогда
		ШиринаЗаголовка = Окр(СтрДлина(Заголовок) * СредняяШиринаСимвола());
	КонецЕсли;
			
	Если ПоследнийЭФ <> Неопределено Тогда
		Верх = ПоследнийЭФ.Верх + ПоследнийЭФ.Высота + 5; // 5 - высота между полями в группе	
	КонецЕсли;
	
	Если ЭтоФлажок Тогда
		ШиринаЗаголовка = Окр(СтрДлина(Заголовок) * СредняяШиринаСимвола()) + 15; // 15 - корректировка для ширины квадратика с флажком
		ПолеВвода = ВывестиФлажок(Форма, Имя, Заголовок, Имя, ПанельСтраниц, Истина, Верх, Лево + 10, ШиринаЗаголовка);	// 10 - отступ в группе
		ПоследнийЭФ = ПолеВвода;
	Иначе
		ПолеЗаголовка = ВывестиНадпись(Форма, "Надпись" + Имя, Заголовок, ПанельСтраниц, Истина, Верх, Лево + 10, ШиринаЗаголовка, Высота); // 10 - отступ в группе	
		ПолеВвода = ВывестиПолеВвода(Форма, Имя, Имя, ПанельСтраниц, Истина, ПолеЗаголовка.Верх, ПолеЗаголовка.Лево + ПолеЗаголовка.Ширина + ДлинаМеждуПолемИЗаголовком(), ШиринаПоляВводаПоУмолчанию());
		Если ПолеВвода.Высота > ПолеЗаголовка.Высота Тогда
			ПоследнийЭФ = ПолеВвода;
		Иначе
			ПоследнийЭФ = ПолеЗаголовка;
		КонецЕсли;
	КонецЕсли;
				
КонецПроцедуры

Процедура ВывестиРеквизитТЧ(Форма, ОбъектМетаданных, ТЧ, Реквизит)
	
	ИмяОбъекта = ОбъектМетаданных.Имя;
	
	Настройка = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФПовтИсп.ПолучитьНастройкуДопРеквизита(Реквизит.Ключ, ИмяОбъекта);
	Если ЗначениеЗаполнено(Настройка) И Не Настройка.Отображать Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ЭлементыФормы[ТЧ].Колонки.Добавить(Реквизит.Ключ, Реквизит.Значение.Заголовок);
	
	Форма.ЭлементыФормы[ТЧ].Колонки[Реквизит.Ключ].ПодсказкаВШапке = Реквизит.Значение.Заголовок + " (Контур.Логистика)";
	
	Если Реквизит.Значение.ЭтоФлажок Тогда
		Форма.ЭлементыФормы[ТЧ].Колонки[Реквизит.Ключ].Ширина = 20;
		Форма.ЭлементыФормы[ТЧ].Колонки[Реквизит.Ключ].ДанныеФлажка = Реквизит.Ключ;
		Форма.ЭлементыФормы[ТЧ].Колонки[Реквизит.Ключ].УстановитьЭлементУправления(Тип("Флажок"));
		Форма.ЭлементыФормы[ТЧ].Колонки[Реквизит.Ключ].РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
	Иначе
		Форма.ЭлементыФормы[ТЧ].Колонки[Реквизит.Ключ].Ширина = 25;
		Форма.ЭлементыФормы[ТЧ].Колонки[Реквизит.Ключ].Данные = Реквизит.Ключ;
		Форма.ЭлементыФормы[ТЧ].Колонки[Реквизит.Ключ].УстановитьЭлементУправления(Тип("ПолеВвода"));
		Форма.ЭлементыФормы[ТЧ].Колонки[Реквизит.Ключ].ЭлементУправления.КнопкаВыбора = Истина;
	КонецЕсли;
		
КонецПроцедуры

Функция ВывестиНадпись(Форма, Имя, Заголовок, ПоместитьНа, Отображать, Верх, Лево, Ширина, Высота = 19)
			
	Надпись = Форма.ЭлементыФормы.Добавить(Тип("Надпись"), Имя, Истина, ПоместитьНа);
	Надпись.Верх = Верх;
	Надпись.Лево = Лево;
	Надпись.Ширина = Ширина;
	Надпись.Высота = Высота;
	Надпись.Заголовок = Заголовок;
	Надпись.Видимость = Отображать;
	
	Возврат Надпись;
	
КонецФункции

Функция ВывестиФлажок(Форма, Имя, Заголовок, ПутьКДанным, ПоместитьНа, Отображать, Верх, Лево, Ширина, Высота = 19)
	
	Флажок = Форма.ЭлементыФормы.Добавить(Тип("Флажок"), Имя, Истина, ПоместитьНа);
	Флажок.Верх = Верх;
	Флажок.Лево = Лево;
	Флажок.Ширина = Ширина;
	Флажок.Высота = Высота;
	Флажок.Заголовок = Заголовок;
	Флажок.Видимость = Отображать;
	
	Флажок.Данные = ПутьКДанным;

	Возврат Флажок;
	
КонецФункции

Функция ВывестиПолеВвода(Форма, Имя, ПутьКДанным, ПоместитьНа, Отображать, Верх, Лево, Ширина, Высота = 19)
	
	ПолеВвода = Форма.ЭлементыФормы.Добавить(Тип("ПолеВвода"), Имя, Истина, ПоместитьНа);
	ПолеВвода.Верх = Верх;
	ПолеВвода.Лево = Лево;
	ПолеВвода.Ширина = Ширина;
	ПолеВвода.Высота = Высота;
	ПолеВвода.Видимость = Отображать;
	
	ПолеВвода.Данные = ПутьКДанным;
    	
	Возврат ПолеВвода;
	
КонецФункции

Функция ВывестиРамкуГруппы(Форма, Имя, Заголовок, ПоместитьНа, Верх, Лево, Ширина, Высота)
	
	Рамка = Форма.ЭлементыФормы.Добавить(Тип("РамкаГруппы"), Имя, Истина, ПоместитьНа);
	Рамка.Верх = Верх;
	Рамка.Лево = Лево;
	Рамка.Ширина = Ширина;
	Рамка.Высота = Высота;
	
	Рамка.Заголовок = Заголовок;
	
	Возврат Рамка;
	
КонецФункции

Функция ВывестиПанель(Форма, Имя, ПоместитьНа, Верх, Лево)
	
	вычГраницаЭлементаУправления = Вычислить("ГраницаЭлементаУправления");
	
	Панель = Форма.ЭлементыФормы.Добавить(Тип("Панель"), Имя, Истина, ПоместитьНа);
	Панель.Верх = Верх;
	Панель.Лево = Лево;
	Панель.Ширина = ПоместитьНа.Ширина - 10;
	Панель.Высота = ПоместитьНа.Высота - 40;
	
	Панель.УстановитьПривязку(вычГраницаЭлементаУправления.Верх, ПоместитьНа, вычГраницаЭлементаУправления.Верх);
	Панель.УстановитьПривязку(вычГраницаЭлементаУправления.Низ, ПоместитьНа, вычГраницаЭлементаУправления.Низ);
	Панель.УстановитьПривязку(вычГраницаЭлементаУправления.Право, ПоместитьНа, вычГраницаЭлементаУправления.Право);
	Панель.УстановитьПривязку(вычГраницаЭлементаУправления.Лево, ПоместитьНа, вычГраницаЭлементаУправления.Лево);
	
	Возврат Панель;
	
КонецФункции

#КонецОбласти

#Область Автоконвертация
			
Процедура ЗаполнитьНастройкиДополнительныхРеквизитов(ПерезаполнитьНастройкиКонвертации = Ложь, ТихийРежим = Ложь) Экспорт

	Попытка
	
		УстановитьПривилегированныйРежим(Истина);		
		Если КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФПовтИсп.КонфигурацияСДополнительнымиРеквизитамиУстановлена() Тогда			
			
			Если ПерезаполнитьНастройкиКонвертации Тогда
				ЗаполнитьНастройкиКонвертацииДополнительнымиРеквизитами(ТихийРежим);
			Иначе
				Если Не КонтурЛогистика_ОбщегоНазначенияСервер.НастройкиДополнительныхРеквизитовЗаполнены()
					И КонтурЛогистика_ОбщегоНазначенияСервер.ЕстьНастройкиКонвертацииДокументов() Тогда					
					ЗаполнитьНастройкиКонвертацииДополнительнымиРеквизитами(ТихийРежим);
					Справочники.КонтурЛогистика_НастройкиДополнительныхРеквизитов.ЗаполнитьПоУмолчанию();
				КонецЕсли;
			КонецЕсли;						
			
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
	Исключение
		
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстОшибки = "Ошибка при заполнение настроек конвертаций дополнительными реквизитами. Ошибка: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
	КонецПопытки
		
КонецПроцедуры

Процедура ЗаполнитьНастройкиКонвертацииДополнительнымиРеквизитами(ТихийРежим = Ложь, Параметры = Неопределено) Экспорт
	
	ОбщийМодуль = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("КонтурЛогистика_ДопРеквизитыОФ_Манифест");
	Если ОбщийМодуль = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокДополнительныхРеквизитов = ОбщийМодуль.СписокДополнительныхРеквизитов();
	
	СписокНастроекКонвертации = Новый Массив;
	
	ОбработатьСтруктуруДополнительныхРеквизитов(СписокДополнительныхРеквизитов, СписокНастроекКонвертации,,, Параметры);
	
	Если Не ТихийРежим Тогда
		КонтурЛогистика_ОбщегоНазначенияСервер.ВывестиСообщенияЗаполненияНастроекДополнительнымиРеквизитами(СписокНастроекКонвертации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСтруктуруДополнительныхРеквизитов(ОписаниеДополнительногоРеквизита, СписокНастроекКонвертации, РеквизитТЧ = Ложь, 
	ИмяРеквизита = Неопределено, Параметры = Неопределено)
	
	Для каждого ОписаниеРеквизита Из ОписаниеДополнительногоРеквизита Цикл
		
		Если ТипЗнч(ОписаниеРеквизита.Значение) <> Тип("Структура") Тогда
			Продолжить;	
		ИначеЕсли ОписаниеРеквизита.Значение.Свойство("СписокСвойствАвтоконвертации") Тогда
			
			Если ЗначениеЗаполнено(ИмяРеквизита) И ИмяРеквизита <> ОписаниеРеквизита.Ключ Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого СвойстваАвтоконвертации Из ОписаниеРеквизита.Значение.СписокСвойствАвтоконвертации Цикл
		
				Если Не ЗначениеЗаполнено(СвойстваАвтоконвертации.РеквизитСправочникаИлиДокументаЛогистика)
					Или Не ЗначениеЗаполнено(СвойстваАвтоконвертации.ТипОбъекта1С)
					Или Не ЗначениеЗаполнено(СвойстваАвтоконвертации.ТипОбъектаЛогистика)
					Или Не ЗначениеЗаполнено(СвойстваАвтоконвертации.ОбъектКонфигурации) Тогда
					Продолжить;
				КонецЕсли;
				
				Если Параметры <> Неопределено
					И Параметры.ТипОбъектаЛогистика <> СвойстваАвтоконвертации.ТипОбъектаЛогистика
					И Параметры.ТипОбъекта1С <> СвойстваАвтоконвертации.ТипОбъекта1С 
					И Параметры.РеквизитТитула <> СвойстваАвтоконвертации.РеквизитТитула Тогда					
					Продолжить;	
				КонецЕсли;
				
				НастройкаДопРеквизита = Справочники.КонтурЛогистика_НастройкиДополнительныхРеквизитов.ПолучитьНастройкуДопРеквизита(
					ОписаниеРеквизита.Ключ, СвойстваАвтоконвертации.ОбъектКонфигурации);
				
				КонтурЛогистика_ОбщегоНазначенияСервер.ВыполнитьНастройкуАвтоконвертации(СписокНастроекКонвертации, НастройкаДопРеквизита, РеквизитТЧ, ОписаниеРеквизита.Ключ, СвойстваАвтоконвертации);
				
			КонецЦикла;
					
		Иначе
			РеквизитТЧ = ?(ОписаниеДополнительногоРеквизита.Свойство("ЗаголовокТЧ"), Истина, Ложь);
			ОбработатьСтруктуруДополнительныхРеквизитов(ОписаниеРеквизита.Значение, СписокНастроекКонвертации, РеквизитТЧ, ИмяРеквизита);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНастройкуКонвертацииДополнительнымРеквизитом(ИмяРеквизита, ИмяТЧ) Экспорт
	
	ОбщийМодуль = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("КонтурЛогистика_ДопРеквизитыОФ_Манифест");
	Если ОбщийМодуль = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокДополнительныхРеквизитов = ОбщийМодуль.СписокДополнительныхРеквизитов();
	
	СписокНастроекКонвертации = Новый Массив;
	
	РеквизитТЧ = ?(ЗначениеЗаполнено(ИмяТЧ), Истина, Ложь);
	ОбработатьСтруктуруДополнительныхРеквизитов(СписокДополнительныхРеквизитов, СписокНастроекКонвертации, РеквизитТЧ, ИмяРеквизита);
		
	КонтурЛогистика_ОбщегоНазначенияСервер.ВывестиСообщенияЗаполненияНастроекДополнительнымиРеквизитами(СписокНастроекКонвертации);
					
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеФункции

Функция СписокДополнительныхРеквизитовОбъекта(Объект, УчитыватьНастройки, Форма = Неопределено) Экспорт

	Если ТипЗнч(Объект) = Тип("ОбъектМетаданных") Тогда
		ИмяОбъекта = Объект.Имя;
		ОбъектМетаданных = Объект;
	Иначе
		ИмяОбъекта = Объект.Метаданные().Имя;
		ОбъектМетаданных = Объект.Метаданные();
	КонецЕсли;
	
	ОбщийМодуль = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("КонтурЛогистика_ДопРеквизитыОФ_Манифест");
	Если ОбщийМодуль = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СписокРеквизитов = ОбщийМодуль.СписокДополнительныхРеквизитов();
	
	Если Не СписокРеквизитов.Свойство(ИмяОбъекта) Тогда
		
		ОсновнаяГруппа = Новый Структура;
		ОписаниеГруппыОбъекта = ОбщийМодуль.ОписаниеГруппыОбъекта();
		ОписаниеГруппыОбъекта.ЗаголовокГруппы = "Основная";
		ОписаниеГруппыОбъекта.Реквизиты = Новый Структура;
		ОсновнаяГруппа.Вставить("КонтурЛогистика_Основная", ОписаниеГруппыОбъекта);
		
		СписокРеквизитов.Вставить(ИмяОбъекта, ОсновнаяГруппа);
		
	КонецЕсли;
	
	// Добавим в список дополнительные реквизиты без манифеста
	Для каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		
		Если Лев(Реквизит.Имя, 16) = "КонтурЛогистика_" И Не РеквизитЕстьВМанифесте(Реквизит.Имя, СписокРеквизитов[ИмяОбъекта]) Тогда
			
			Если СписокРеквизитов[ИмяОбъекта].Свойство("КонтурЛогистика_Основная") Тогда
				ОписаниеРеквизита = ОбщийМодуль.ОписаниеРеквизитаОбъекта();
				ОписаниеРеквизита.Заголовок = Реквизит.Синоним;
				СписокРеквизитов[ИмяОбъекта].КонтурЛогистика_Основная.Реквизиты.Вставить(Реквизит.Имя, ОписаниеРеквизита);	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ТЧ Из ОбъектМетаданных.ТабличныеЧасти Цикл
		
		Для каждого Реквизит Из ТЧ.Реквизиты Цикл
			
			Если Лев(Реквизит.Имя, 16) = "КонтурЛогистика_" И Не РеквизитЕстьВМанифесте(Реквизит.Имя, СписокРеквизитов[ИмяОбъекта]) Тогда
				
				Если СписокРеквизитов[ИмяОбъекта].Свойство(ТЧ.Имя) Тогда
					ОписаниеРеквизита = ОбщийМодуль.ОписаниеРеквизитаОбъекта();
					ОписаниеРеквизита.Заголовок = Реквизит.Синоним;
					СписокРеквизитов[ИмяОбъекта][ТЧ.Имя].Реквизиты.Вставить(Реквизит.Имя, ОписаниеРеквизита);	
				Иначе
					СписокРеквизитовТЧ = Новый Структура;

					ОписаниеРеквизита = ОбщийМодуль.ОписаниеРеквизитаОбъекта();
					ОписаниеРеквизита.Заголовок = Реквизит.Синоним;
					СписокРеквизитовТЧ.Вставить(Реквизит.Имя, ОписаниеРеквизита);
																		
					ОписаниеТЧОбъекта = ОбщийМодуль.ОписаниеТЧОбъекта();
					ОписаниеТЧОбъекта.ЗаголовокТЧ = ТЧ.Синоним;
					ОписаниеТЧОбъекта.ЗаголовокДляНастроек = ТЧ.Синоним;
					ОписаниеТЧОбъекта.Реквизиты = СписокРеквизитовТЧ;
					СписокРеквизитов[ИмяОбъекта].Вставить(ТЧ.Имя, ОписаниеТЧОбъекта);													
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого РеквизитГруппа Из СписокРеквизитов[ИмяОбъекта] Цикл
						
		Если РеквизитГруппа.Значение.Свойство("ЗаголовокГруппы") Тогда
			
			тзРазметка = Новый ТаблицаЗначений;
			тзРазметка.Колонки.Добавить("Реквизит");
			тзРазметка.Колонки.Добавить("Ширина");
			тзРазметка.Колонки.Добавить("Высота");
			
			Для каждого Реквизит Из РеквизитГруппа.Значение.Реквизиты Цикл
				
				Если Форма <> Неопределено И Форма.ЭлементыФормы.Найти(Реквизит.Ключ) <> Неопределено Тогда
					РеквизитГруппа.Значение.Реквизиты.Удалить(Реквизит.Ключ);
					Продолжить;	
				КонецЕсли;
				
				Настройка = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФПовтИсп.ПолучитьНастройкуДопРеквизита(Реквизит.Ключ, ИмяОбъекта);
				Если ЗначениеЗаполнено(Настройка) И Не Настройка.Отображать И УчитыватьНастройки Тогда
					РеквизитГруппа.Значение.Реквизиты.Удалить(Реквизит.Ключ);
				Иначе
					
					Если Реквизит.Значение.ЭтоФлажок Тогда
						Ширина = 0;	
					Иначе
						Ширина = Окр(СтрДлина(Реквизит.Значение.Заголовок) * СредняяШиринаСимвола());
					КонецЕсли;
					
					// перенос заголовка на новую строку
					Если Ширина > 200 Тогда							
						Высота = 19 + (Цел(Ширина / 200)) * 10;
						Ширина = 200;
					Иначе
						Высота = 19;
					КонецЕсли;
											
					НоваяСтрока = тзРазметка.Добавить();
					НоваяСтрока.Реквизит = Реквизит.Ключ;
					НоваяСтрока.Ширина = Ширина;
					НоваяСтрока.Высота = Высота;
											
				КонецЕсли;
								
			КонецЦикла;
			
			Если тзРазметка.Количество() > 0 Тогда
				РеквизитГруппа.Значение.тзРазметка = тзРазметка;
			КонецЕсли;
			
		ИначеЕсли РеквизитГруппа.Значение.Свойство("ЗаголовокТЧ") Тогда
			
			Для каждого Реквизит Из РеквизитГруппа.Значение.Реквизиты Цикл
				
				Если Форма <> Неопределено И Форма.ЭлементыФормы.Найти(Реквизит.Ключ) <> Неопределено Тогда
					РеквизитГруппа.Значение.Реквизиты.Удалить(Реквизит.Ключ);
					Продолжить;	
				КонецЕсли;
				
				Настройка = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФПовтИсп.ПолучитьНастройкуДопРеквизита(Реквизит.Ключ, ИмяОбъекта);
				Если ЗначениеЗаполнено(Настройка) И Не Настройка.Отображать И УчитыватьНастройки Тогда
					РеквизитГруппа.Значение.Реквизиты.Удалить(Реквизит.Ключ);
				КонецЕсли;	
				
			КонецЦикла;
			
		Иначе
			
			Настройка = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФПовтИсп.ПолучитьНастройкуДопРеквизита(РеквизитГруппа.Ключ, ИмяОбъекта);
			Если ЗначениеЗаполнено(Настройка) И Не Настройка.Отображать И УчитыватьНастройки Тогда
				СписокРеквизитов[ИмяОбъекта].Удалить(РеквизитГруппа.Ключ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокРеквизитов[ИмяОбъекта];
	
КонецФункции

Функция РеквизитЕстьВМанифесте(ИмяРеквизита, СписокДополнительныхРеквизитов)

	Для каждого РеквизитГруппа Из СписокДополнительныхРеквизитов Цикл
		Для каждого Реквизит Из РеквизитГруппа.Значение.Реквизиты Цикл
			Если Реквизит.Ключ = ИмяРеквизита Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура КоличествоРеквизитов(СписокДополнительныхРеквизитов, КолвоГрупп, КолвоРеквизитов, КолвоРеквизитовТЧ)
	
	Для каждого РеквизитГруппа Из СписокДополнительныхРеквизитов Цикл
		
		Если РеквизитГруппа.Значение.Свойство("ЗаголовокГруппы") Тогда
			КолвоГрупп = КолвоГрупп + 1;
		КонецЕсли;
			
		Для каждого Реквизит Из РеквизитГруппа.Значение.Реквизиты Цикл
			Если РеквизитГруппа.Значение.Свойство("ЗаголовокГруппы") Тогда
				КолвоРеквизитов = КолвоРеквизитов + 1;
			Иначе
				КолвоРеквизитовТЧ = КолвоРеквизитовТЧ + 1;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция МаксимальноеЗначениеВМассиве(массив)
	
	Если массив.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	МаксЗнч = массив[0];

    Для каждого лкЗнч Из массив Цикл
        МаксЗнч = Макс(МаксЗнч, лкЗнч);
	КонецЦикла;
		
	Возврат МаксЗнч;
	
КонецФункции

Функция ШиринаПоляВводаПоУмолчанию()
	Возврат 250;
КонецФункции

Функция ДлинаМеждуПолемИЗаголовком()
	Возврат 10;
КонецФункции

Функция СредняяШиринаСимвола()
	Возврат 6.2;
КонецФункции

#КонецОбласти
